Repository: seventh/codemetre
Catalog: i18n/*/LC_MESSAGES/codemetre.po
Languages: fr

source: unauthorized character
fr: caractère non autorisé

source: wrong section name
fr: nom de section incorrect

source: unassociated variable
fr: variable sans valeur

source: unknown operator
fr: opérateur inconnu

source: no value associated to variable
fr: aucune valeur n'est associée à la variable

source: lexer is buggy!
fr: bogue dans l'analyseur !

source: incomplete identifier
fr: identifiant incomplet

source: incomplete integer constant
fr: constante littérale entière incomplète

source: forbidden character in based integer constant
fr: caractère interdit dans constante littérale entière basée

source: wrong value in based integer constant
fr: valeur incorrecte dans constante littérale numérique basée

source: forbidden character in decimal part of based integer constant
fr: caractère interdit dans partie décimale de constante littérale numérique basée

source: incomplete exponent in integer constant
fr: exposant incomplet dans constante littérale numérique

source: wrong exponent in integer constant
fr: exposant incorrect dans constante littérale numérique

source: wrong decimal part in integer constant
fr: partie décimale incorrecte dans constante littérale numérique

source: forbidden character in decimal part of integer constant
fr: caractère interdit dans partie décimale de constante littérale numérique

source: incomplete character constant
fr: constante littérale caractère incomplète

source: incomplete string constant
fr: constante littérale chaîne incomplète

source: forbidden character in character constant
fr: caractère interdit dans constante littérale caractère

source: forbidden character
fr: caractère non autorisé

source: *** Error: file "
fr: *** Erreur : le fichier "

source: " is unreachable.
fr: " n'est pas accessible.

source: " is not written in
fr: " n'est pas du langage

source: line
fr: ligne

source: incomplete real constant
fr: nombre réel incomplet

source: unexpected end-of-line in string constant
fr: saut-de-ligne inattendu dans littéral chaîne

source: unknown special character
fr: caractère spécial non reconnu

source: unknown character after '%' mark
fr: caractère non reconnu après '%%'

source: unexpected character in ASCII code
fr: caractère inattendu dans un code ASCII

source: nul length ASCII code
fr: code ASCII de longueur nulle

source: ASCII code is out of range
fr: code ASCII hors intervalle autorisé

source: hexadecimal constant shall be made of an even number of digits
fr: les littéraux caractères hexadécimaux doivent être composés d'un nombre pair de chiffres

source: hexadecimal code of unicode character is 8 digits max
fr: un code hexadécimal pour un caractère unicode ne peut dépasser 8 chiffres

source: wrong unicode spelling
fr: notation unicode invalide

source: unexpected end-of-file in multiline constant string
fr: fin de fichier inattendue dans chaîne caractère muli-ligne

source: margins in string constant
fr: non respect des marges dans littéral chaîne

source: unknown operator "\"
fr: opérateur inconnu "\"

source: forgotten exponent in numerical constant
fr: oubli de l'exposant dans une constante littérale numérique

source: incomplete '%:%:' separator
fr: séparateur '%:%:' incomplet

source: incomplete triglyph
fr: triglyphe incomplet

source: non respected end-of-line marker in split string
fr: marque de saut de ligne non respectée dans chaîne multi-ligne

source: incomplete ellipsis
fr: ellipse incomplète

source: non respected end-of-line marker
fr: marque de saut de ligne non respectée

source: unknown prefix
fr: préfixe non reconnu

source: end-of-line in character constant
fr: saut de ligne dans un caractère

source: end-of-line in string constant
fr: saut de ligne dans une chaîne

source: incomplete multiline comment
fr: commentaire multi-ligne incomplet

source: incomplete comment
fr: commentaire incomplet

source: " cannot be written
fr: " ne peut être écrit

source: This program comes with ABSOLUTELY NO WARRANTY. This is free software, and you are welcome to redistribute it under certain conditions.
fr: Ce programme n'est en aucun cas garanti. Vous êtes invités à redistribuer ce logiciel libre sous certaines conditions.

source: Error: extension of file "
fr: L'extension du fichier "

source: " is unknown
fr: " n'est pas reconnue

source: analysis section is obsolete. Use diff:dump and unit:dump instead
fr: 'diff:dump' et 'unit:dump' remplacent la section obsolète 'analysis'

source: diff:dump is not a list
fr: la variable 'diff:dump' n'est pas une liste

source: diff:filter can only have a single value
fr: une seule valeur est autorisée dans 'diff:filter'

source: diff:model is not a list
fr: la variable 'diff:model' n'est pas une liste

source: diff:short is not a list
fr: la variable 'diff:short' n'est pas une liste

source: diff:status is not a list
fr: la variable 'diff:status' n'est pas une liste

source: unknown parameter in diff section
fr: paramètre inconnu dans section 'diff'

source: suffix is already associated with another language
fr: suffixe déjà associé à un autre langage

source: redundant association
fr: couplage redondant

source: unit:dump is not a list
fr: la variable 'unit:dump' n'est pas une liste

source: unit:status is not a list
fr: la variable 'unit:status' n'est pas une liste

source: unknown parameter in unit section
fr: paramètre inconnu dans section 'unit'

source: unknown section
fr: section inconnue

source: diff:dump is not clearable
fr: 'diff:dump' doit avoir une valeur associée

source: diff:filter is mandatory
fr: 'diff:filter' doit avoir une valeur associée

source: diff:model is mandatory
fr: la variable 'diff:model' est obligatoire

source: diff:short is not clearable
fr: 'diff:short' doit avoir une valeur associée

source: diff:status is not clearable
fr: 'diff:status' doit avoir une valeur associée

source: unit:dump is not clearable
fr: 'unit:dump' doit avoir une valeur associée

source: unit:filter is mandatory
fr: 'unit:filter' doit avoir une valeur associée

source: unit:status is not clearable
fr: 'unit:status' doit avoir une valeur associée

source: unknown diff model
fr: modèle de comparaison inconnu

source: invalid boolean value
fr: la valeur passée n'est pas un booléen

source: no such association exists
fr: une telle association n'existe pas

source: Syntax error
fr: Syntaxe incorrecte

source: unknown filter
fr: option de filtrage non reconnue

source: removing filters leaves empty set
fr: supprimer ce filtre empêcherait toute analyse

source: too many "--dump" option
fr: option "--dump" surnuméraire

source: mode is enforced more than once
fr: le mode est spécifié au moins deux fois

source: "--config" is incompatible with any other argument
fr: "--config" ne peut être associé avec aucun autre argument

source: too many "--code" option
fr: option "--code" surnuméraire

source: too many "--comment" option
fr: option "--comment" surnuméraire

source: too many "--total" option
fr: option "--total" surnuméraire

source: language is enforced more than once
fr: le langage est spécifié au moins deux fois

source: too many diff models
fr: le modèle de comparaison est précisé au moins deux fois

source: too many "--status" option
fr: option "--status" surnuméraire

source: too many "--short" option
fr: option "--short" surnuméraire

source: "--version" is incompatible with any other argument
fr: "--version" ne peut être associé avec aucun autre argument

source: unknown language
fr: langage inconnu

source: one filter only for diff
fr: une seule filtre autorisé lors d'une demande de comparaison

source: no diff model is required for measure
fr: il n'est pas utile de préciser le modèle de comptage différentiel pour un comptage unitaire

source: short output is available only for diff
fr: l'affichage court n'est possible que lors d'une demande de comparaison

source: two files are required in diff mode
fr: il faut deux fichiers en mode différentiel

source: at least one of the two arguments shall exists
fr: on ne peut comparer ce qui n'existait pas et ce qui n'existe plus

source: batch file cannot be compared to single file or directory
fr: un lot ne peut qu'être comparé à un autre lot

source: directory cannot be compared to single or batch file
fr: un répertoire ne peut qu'être comparé à un autre répertoire

source: FILE|DIRECTORY|BATCH...
fr: FICHIER|RÉPERTOIRE|LOT ...

source: For further information:
fr: Pour de plus amples informations :

source: - see
fr: - voyez

source: - visit
fr: - visitez

source: Syntax error:
fr: Syntaxe incorrecte :

source: Error: batch file "
fr: Erreur : le lot "

source: " cannot be open for reading
fr: " est inaccessible en lecture

source: Error: "
fr: Erreur : "

source: " is empty
fr: est vide

source: Syntax error in batch file:
fr: Lot en erreur :

source: "dirtype" directive shall either be empty, 'unix' or 'windows'
fr: la directive "dirtype" doit être soit vide, soit valoir 'unix' ou 'windows'

source: "dirname" directive shall be a valid directory name
fr: toute directive "dirname" doit être un nom de répertoire valide
